alinour64/AssemblyFinalProject/AssemblyFinalProject/Assembly_Final_Project_Files/Thumb2_Programs/startup_TM4C129_midpoint.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
		IMPORT	_syscall_table_init
		IMPORT	_heap_init
		IMPORT	_timer_init

		; Store __initial_sp into MSP (Step 1 toward Midpoint Report)	
		LDR	R0, =__initial_sp ; thread mode uses MSP
		MSR	MSP, R0

		ISB     ; Let's leave as is from the original.
                LDR     R0, =SystemInit
        	BLX     R0

		; Initialize the system call table (Step 2)
		LDR     R0, =_syscall_table_init
		BLX     R0

		; Initialize the heap space (Step 2)
		LDR     R0, =_heap_init
		BLX     R0

		; Initialize the SysTick timer (Step 2)
		LDR     R0, =_timer_init
		BLX     R0

	
		; Store __initial_user_sp into PSP (Step 1 toward Midpoint Report)
		LDR	R0, =__initial_user_sp
	        MSR	PSP, R0
	
		; Change CPU mode into unprivileged thread mode using PSP
		MOVS	R0,	#3	; Set SPSEL bit 1, nPriv bit 0
		MSR	CONTROL, R0	; Now thread mode uses PSP for user
	
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler PROC
    EXPORT SVC_Handler [WEAK]
		; Save registers 
		; Invoke _syscall_table_ump
		; Retrieve registers
		; Go back to stdlib.s
    PUSH {R4-R11, LR}
    MRS R0, PSP             
    LDR R1, [R0, #24]    
    SUB R1, R1, #2        
    LDRB R1, [R1]         
    
    LDR R2, =SYSTEMCALLTBL 
    LSL R1, R1, #2
    ADD R2, R2, R1   
    LDR R2, [R2]         
    BLX R2                 

    POP {R4-R11, LR}
    BX LR

ENDP

DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC		; (Step 2)
        	EXPORT  SysTick_Handler           [WEAK]
		; Save registers
		; Invoke _timer_update
		; Retrieve registers
		; Change from MSP to PSP
		; Go back to the user program
		PUSH {R4-R11, LR}
		BL _timer_update
		POP {R4-R11, LR}
		MRS R0, CONTROL 
		ORRS R0, R0, #0x02
		MSR CONTROL, R0
		ISB   
        BX LR    
        ENDP

GPIOA_Handler\
                PROC
                EXPORT  GPIOA_Handler [WEAK]
                B       .
                ENDP

GPIOB_Handler\
                PROC
                EXPORT  GPIOB_Handler [WEAK]
                B       .
                ENDP

GPIOC_Handler\
                PROC
                EXPORT  GPIOC_Handler [WEAK]
                B       .
                ENDP

GPIOD_Handler\
                PROC
                EXPORT  GPIOD_Handler [WEAK]
                B       .
                ENDP

GPIOE_Handler\
                PROC
                EXPORT  GPIOE_Handler [WEAK]
                B       .
                ENDP

UART0_Handler\
                PROC
                EXPORT  UART0_Handler [WEAK]
                B       .
                ENDP

UART1_Handler\
                PROC
                EXPORT  UART1_Handler [WEAK]
                B       .
                ENDP

SSI0_Handler\
                PROC
                EXPORT  SSI0_Handler [WEAK]
                B       .
                ENDP

I2C0_Handler\
                PROC
                EXPORT  I2C0_Handler [WEAK]
                B       .
                ENDP

PMW0_FAULT_Handler\
                PROC
                EXPORT  PMW0_FAULT_Handler [WEAK]
                B       .
                ENDP

PWM0_0_Handler\
                PROC
                EXPORT  PWM0_0_Handler [WEAK]
                B       .
                ENDP

PWM0_1_Handler\
                PROC
                EXPORT  PWM0_1_Handler [WEAK]
                B       .
                ENDP

PWM0_2_Handler\
                PROC
                EXPORT  PWM0_2_Handler [WEAK]
                B       .
                ENDP

QEI0_Handler\
                PROC
                EXPORT  QEI0_Handler [WEAK]
                B       .
                ENDP

ADC0SS0_Handler\
                PROC
                EXPORT  ADC0SS0_Handler [WEAK]
                B       .
                ENDP

ADC0SS1_Handler\
                PROC
                EXPORT  ADC0SS1_Handler [WEAK]
                B       .
                ENDP

ADC0SS2_Handler\
                PROC
                EXPORT  ADC0SS2_Handler [WEAK]
                B       .
                ENDP

ADC0SS3_Handler\
                PROC
                EXPORT  ADC0SS3_Handler [WEAK]
                B       .
                ENDP

WDT0_Handler\
                PROC
                EXPORT  WDT0_Handler [WEAK]
                B       .
                ENDP

TIMER0A_Handler\
                PROC
                EXPORT  TIMER0A_Handler [WEAK]
                B       .
                ENDP

TIMER0B_Handler\
                PROC
                EXPORT  TIMER0B_Handler [WEAK]
                B       .
                ENDP

TIMER1A_Handler\
                PROC
                EXPORT  TIMER1A_Handler [WEAK]
                B       .
                ENDP

TIMER1B_Handler\
                PROC
                EXPORT  TIMER1B_Handler [WEAK]
                B       .
                ENDP

